///////////////////////////////////////////////////////////////////////////////////////
//类模板特化（对某个具体类型的模板参数做特化）
//类模板局部特化（对部分情况的模板参数做特化，有很高的灵活性）
//tips：
//特化后任何没有实现的原模板方法将不存在，意味着如果特化想删除某个方法，可以这么做
//局部特化具有非常高的灵活性，但在思维出现逻辑漏洞时可能会出现二义性的错误
///////////////////////////////////////////////////////////////////////////////////////
#include "chapter3_template_specialization.h"

int main() {
    Stack<int> stack_int_;
    Stack<string> stack_str_;
    stack_int_.push(3.14);
    stack_str_.push("asd");
    //stack_str_.top();//因为没有实现，Stack<std::string>中没有这个方法了
    stack_str_.pop();
}
